VV_cases/V1_solver/results/study_v1/runs/001_data_beta05_initial_verification/02_simulations/baseline_medium_Re090/01_openfoam_setup/0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0.113700000 0 0);

boundaryField
{
    inlet
    {
        type codedFixedValue;
        value uniform (0 0 0);
        name parabolicInlet;
        codeInclude
        #{
            #include "fvCFD.H"
        #};
        code
        #{
            vectorField& field = *this;
            const vectorField& cf = patch().Cf();
            forAll(field, faceI)
            {
                const scalar y = cf[faceI].y();
                const scalar eta = 2.0*y/0.024000000;
                field[faceI] = vector(0.113700000*(1.0 - eta*eta), 0, 0);
            }
        #};
    }
    outlet { type zeroGradient; }
    top { type noSlip; }
    bottom { type noSlip; }
    cylinder { type noSlip; }
    front { type empty; }
    back { type empty; }
}
